app/views/drugs/show.html.erb

            <tbody>
              <% if @drug.isolateds.any? == true %>
---
SELECT "isolateds".* FROM "isolateds" INNER JOIN "resists" ON "isolateds"."id" = "resists"."isolated_id" WHERE "resists"."drug_id" = ?  [["drug_id", 4]]