app/views/isolateds/show.html.erb

            <tbody>
              <% if @isolated.drugs.any? == true%>
---
SELECT "drugs".* FROM "drugs" INNER JOIN "resists" ON "drugs"."id" = "resists"."drug_id" WHERE "resists"."isolated_id" = ?  [["isolated_id", 2]]

            <tbody>
              <% if @isolated.genes.any? == true%>
---
SELECT "genes".* FROM "genes" WHERE "genes"."isolated_id" = ?  [["isolated_id", 2]]