app/views/mutations/show.html.erb

            <tbody>
              <% if @mutation.genes.any? == true %>
---
SELECT "genes".* FROM "genes" INNER JOIN "stats" ON "genes"."id" = "stats"."gene_id" WHERE "stats"."mutation_id" = ?  [["mutation_id", 1]]

            <tbody>
              <%if @mutation.publications.any? == true %>
---
SELECT "publications".* FROM "publications" INNER JOIN "mutpubs" ON "publications"."id" = "mutpubs"."publication_id" WHERE "mutpubs"."mutation_id" = ?  [["mutation_id", 1]]