app/views/organisms/show.html.erb

            <tbody>
              <% @organism.isolateds.each do |isolated| %>
---
SELECT "isolateds".* FROM "isolateds" WHERE "isolateds"."organism_id" = ?  [["organism_id", 2]]