app/views/publications/show.html.erb

SELECT "mutations".* FROM "mutations" INNER JOIN "mutpubs" ON "mutations"."id" = "mutpubs"."mutation_id" WHERE "mutpubs"."publication_id" = ?  [["publication_id", 1]]
---
            <tbody>
              <% @publication.mutations.each do |mutation| %>