app/controllers/dashboards_controller.rb

SELECT `dashboards`.* FROM `dashboards`
---
  def index
    @dashboards = Dashboard.all

SELECT `origins`.* FROM `origins`
SELECT `organisms`.* FROM `organisms`
---
  def new
    @isolated = Isolated.new
    @isolated.genes.new
    @origins = Origin.all
    @organisms = Organism.all

INSERT INTO `isolateds` (`name`, `disease`, `n_samples`, `origin_id`, `organism_id`, `created_at`, `updated_at`) VALUES ('hgdk', 'ça', 12, 2, 2, '2015-03-26 18:58:25.590860', '2015-03-26 18:58:25.590860')
---
  def create
    @isolated = Isolated.new(isolated_params)
    #@isolateds = Isolated.find(params[:isolated_id])
    #@gene = @isolateds.genes.create(gene_params)
    respond_to do |format|
      if @isolated.save