app/controllers/drugs_controller.rb

  def index

    if params[:search]
      @drugs = Drug.search(params[:search]).order(:name, :reference).paginate(:per_page => 3, :page => params[:page])
    else
      @drugs = Drug.all.order(:name, :reference).paginate(:per_page => 3, :page => params[:page])
    end

    @drug = Drug.all
---
SELECT  "drugs".* FROM "drugs" WHERE (name like '%bbb%' OR reference like '%bbb%')  ORDER BY "drugs"."name" ASC, "drugs"."reference" ASC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "drugs" WHERE (name like '%bbb%' OR reference like '%bbb%')
SELECT `drugs`.* FROM `drugs`

  def create
    @drug = Drug.new(drug_params)

    respond_to do |format|
      if @drug.save
---
INSERT INTO "drugs" ("reference", "name", "atc", "drugbank", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["reference", 0], ["name", "Farmacox"], ["atc", "lsiopad"], ["drugbank", "kjasdlrae"], ["created_at", "2015-03-16 22:02:37.856430"], ["updated_at", "2015-03-16 22:02:37.856430"]]

  def update
    respond_to do |format|
      if @drug.update(drug_params)
---
UPDATE "drugs" SET "name" = ?, "updated_at" = ? WHERE "drugs"."id" = ?  [["name", "Farmacoxx"], ["updated_at", "2015-03-16 22:06:01.164413"], ["id", 2]]

  def destroy
    @drug.destroy
---
DELETE FROM "drugs" WHERE "drugs"."id" = ?  [["id", 1]]

    def set_drug
      @drug = Drug.find(params[:id])
---
SELECT  "drugs".* FROM "drugs" WHERE "drugs"."id" = ? LIMIT 1  [["id", 2]]