app/controllers/genes_controller.rb

SELECT  "genes".* FROM "genes" WHERE (name like '%gen1%' OR reference like '%gen1%' OR sequence like '%gen1%')  ORDER BY "genes"."name" ASC, "genes"."reference" ASC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `genes`
---
  def index
    if params[:search]
      @genes = Gene.search(params[:search]).order(:name, :reference).paginate(:per_page => 3, :page => params[:page])

SELECT "isolateds".* FROM "isolateds"
---
  def new
    @gene = Gene.new
    @isolateds = Isolated.all

SELECT "isolateds".* FROM "isolateds"
---
  def edit
    @isolateds = Isolated.all

INSERT INTO "genes" ("name", "sequence", "reference", "uniprot", "symbol", "isolated_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @gene = Gene.new(gene_params)

    respond_to do |format|
      if @gene.save

UPDATE "genes" SET "reference" = ?, "updated_at" = ? WHERE "genes"."id" = ?  [["reference", 12234], ["updated_at", "2015-03-16 23:57:53.564169"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @gene.update(gene_params)

DELETE FROM "genes" WHERE "genes"."id" = ?  [["id", 1]]
---
  def destroy
    @gene.destroy

SELECT  "genes".* FROM "genes" WHERE "genes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_gene
      @gene = Gene.find(params[:id])