app/controllers/genes_controller.rb

SELECT "genes".* FROM "genes"
---
  def index
    @genes = Gene.all