app/controllers/haves_controller.rb

  def index
    @haves = Have.all
---
SELECT "haves".* FROM "haves"