app/controllers/isolateds_controller.rb

  def index
    @isolateds = Isolated.all
---
SELECT "isolateds".* FROM "isolateds"