app/controllers/isolateds_controller.rb

SELECT  "isolateds".* FROM "isolateds" WHERE (name like '%aa%' OR disease like '%aa%')  ORDER BY "isolateds"."name" ASC, "isolateds"."disease" ASC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `isolateds`
---
  def index
    if params[:search]
      @isolateds = Isolated.search(params[:search]).order(:name, :disease).paginate(:per_page => 3, :page => params[:page])

SELECT `origins`.* FROM `origins`
SELECT `organisms`.* FROM `organisms`
---
  def new
    @isolated = Isolated.new
    @origins = Origin.all
    @organisms = Organism.all

SELECT "origins".* FROM "origins"
SELECT "organisms".* FROM "organisms"
---
  def edit
    @origins = Origin.all
    @organisms = Organism.all

INSERT INTO "isolateds" ("name", "disease", "n_samples", "origin_id", "organism_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "cenas"], ["disease", "akljdl"], ["n_samples", 4], ["origin_id", 2], ["organism_id", 2], ["created_at", "2015-03-16 19:23:43.283967"], ["updated_at", "2015-03-16 19:23:43.283967"]]
---
  def create
    @isolated = Isolated.new(isolated_params)

    respond_to do |format|
      if @isolated.save

UPDATE "isolateds" SET "disease" = ?, "updated_at" = ? WHERE "isolateds"."id" = ?  [["disease", "akljdlx"], ["updated_at", "2015-03-16 19:24:16.166017"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @isolated.update(isolated_params)

DELETE FROM "isolateds" WHERE "isolateds"."id" = ?  [["id", 1]]
---
  def destroy
    @isolated.destroy

SELECT  "isolateds".* FROM "isolateds" WHERE "isolateds"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_isolated
      @isolated = Isolated.find(params[:id])