app/controllers/mutations_controller.rb

  def index
    @mutations = Mutation.all
---
SELECT "mutations".* FROM "mutations"