app/controllers/mutations_controller.rb

SELECT  `mutations`.* FROM `mutations`  ORDER BY `mutations`.`nucleotide` ASC, `mutations`.`aminoacid` ASC LIMIT 3 OFFSET 0
---
  def index
    if params[:search]
      @mutations = Mutation.search(params[:search]).order(:nucleotide, :aminoacid).paginate(:per_page => 3, :page => params[:page])

INSERT INTO "mutations" ("nucleotide", "aminoacid", "hgvs", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nucleotide", "klsaçfdasçf"], ["aminoacid", "amsldkças"], ["hgvs", "lksçdafç"], ["created_at", "2015-03-16 22:45:01.949285"], ["updated_at", "2015-03-16 22:45:01.949285"]]
---
  def create
    @mutation = Mutation.new(mutation_params)

    respond_to do |format|
      if @mutation.save

UPDATE "mutations" SET "nucleotide" = ?, "updated_at" = ? WHERE "mutations"."id" = ?  [["nucleotide", "klsaçfdasçf12"], ["updated_at", "2015-03-16 22:45:12.906085"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @mutation.update(mutation_params)

SELECT  "mutations".* FROM "mutations" WHERE "mutations"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_mutation
      @mutation = Mutation.find(params[:id])