app/controllers/mutpubs_controller.rb

SELECT  "mutpubs".* FROM "mutpubs" LIMIT 3 OFFSET 0
---
  def index

      @mutpubs = Mutpub.all.paginate(:per_page => 3, :page => params[:page])

SELECT "mutations".* FROM "mutations"
SELECT "publications".* FROM "publications"
---
  def new
    @mutpub = Mutpub.new
    @mutations = Mutation.all
    @publications = Publication.all

INSERT INTO "mutpubs" ("mutation_id", "publication_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["mutation_id", 1], ["publication_id", 1], ["created_at", "2015-03-17 00:00:05.250996"], ["updated_at", "2015-03-17 00:00:05.250996"]]
---
  def create
    @mutpub = Mutpub.new(mutpub_params)

    respond_to do |format|
      if @mutpub.save

SELECT  "mutpubs".* FROM "mutpubs" WHERE "mutpubs"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_mutpub
      @mutpub = Mutpub.find(params[:id])