app/controllers/organisms_controller.rb

SELECT "organisms".* FROM "organisms"
---
  def index
    @organisms = Organism.all