app/controllers/organisms_controller.rb

SELECT  `organisms`.* FROM `organisms` WHERE (name like '%cee%' OR tax_org like '%cee%')  ORDER BY `organisms`.`name` ASC, `organisms`.`tax_org` ASC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `organisms`
---
  def index
    if params[:search]
      @organisms = Organism.search(params[:search]).order(:name, :tax_org).paginate(:per_page => 3, :page => params[:page])

INSERT INTO "organisms" ("tax_org", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tax_org", 298483294], ["name", "BGSHJ"], ["created_at", "2015-03-16 18:55:35.195887"], ["updated_at", "2015-03-16 18:55:35.195887"]]
---
  def create
    @organism = Organism.new(organism_params)

    respond_to do |format|
      if @organism.save

UPDATE "organisms" SET "name" = ?, "updated_at" = ? WHERE "organisms"."id" = ?  [["name", "BGSHJS"], ["updated_at", "2015-03-16 18:56:32.649436"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @organism.update(organism_params)

DELETE FROM "organisms" WHERE "organisms"."id" = ?  [["id", 1]]
---
  def destroy
    @organism.destroy

SELECT  "organisms".* FROM "organisms" WHERE "organisms"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_organism
      @organism = Organism.find(params[:id])