app/controllers/origins_controller.rb

  def index
    @origins = Origin.all
---
SELECT "origins".* FROM "origins"