app/controllers/origins_controller.rb

  def index
    if params[:search]
      @origins = Origin.search(params[:search]).order(:origin_t, :lab_name).paginate(:per_page => 3, :page => params[:page])
---
SELECT  `origins`.* FROM `origins`  ORDER BY `origins`.`origin_t` ASC, `origins`.`lab_name` ASC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `origins`

  def create
    @origin = Origin.new(origin_params)

    respond_to do |format|
      if @origin.save
---
INSERT INTO "origins" ("origin_t", "lab_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["origin_t", "sangue"], ["lab_name", "Laboratorio de Aveiro"], ["created_at", "2015-03-16 19:09:19.332250"], ["updated_at", "2015-03-16 19:09:19.332250"]]

  def update
    respond_to do |format|
      if @origin.update(origin_params)
---
UPDATE "origins" SET "origin_t" = ?, "lab_name" = ?, "updated_at" = ? WHERE "origins"."id" = ?  [["origin_t", "In Vitro"], ["lab_name", "Laboratorio de Aveiro1"], ["updated_at", "2015-03-16 19:09:41.419630"], ["id", 1]]

  def destroy
    @origin.destroy
---
DELETE FROM "origins" WHERE "origins"."id" = ?  [["id", 1]]

    def set_origin
      @origin = Origin.find(params[:id])
---
SELECT  "origins".* FROM "origins" WHERE "origins"."id" = ? LIMIT 1  [["id", 1]]