app/controllers/publications_controller.rb

SELECT "publications".* FROM "publications"
---
  def index
    @publications = Publication.all

INSERT INTO "publications" ("author", "title", "date", "journal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "Manuel"], ["title", "lkaiwskldaç<lsd"], ["date", "2014-03-22"], ["journal", "jsldak"], ["created_at", "2015-03-16 23:59:12.886780"], ["updated_at", "2015-03-16 23:59:12.886780"]]
---
  def create
    @publication = Publication.new(publication_params)

    respond_to do |format|
      if @publication.save

SELECT  "publications".* FROM "publications" WHERE "publications"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_publication
      @publication = Publication.find(params[:id])