app/controllers/publications_controller.rb

  def index
     if params[:search]
      @publications = Publication.search(params[:search]).order(:title, :author, :date, :journal).paginate(:per_page => 3, :page => params[:page])
---
SELECT  "publications".* FROM "publications"  ORDER BY "publications"."title" ASC, "publications"."author" ASC, "publications"."date" ASC, "publications"."journal" ASC LIMIT 3 OFFSET 0