app/controllers/resists_controller.rb

  def index
     @resists = Resist.all.paginate(:per_page => 3, :page => params[:page])
---
SELECT  `resists`.* FROM `resists` LIMIT 3 OFFSET 0

  def new
    @resist = Resist.new
    @drugs = Drug.all
    @isolateds = Isolated.all
---
SELECT `drugs`.* FROM `drugs`
SELECT `isolateds`.* FROM `isolateds`

  def edit
    @drugs = Drug.all
    @isolateds = Isolated.all
---
SELECT "drugs".* FROM "drugs"
SELECT "isolateds".* FROM "isolateds"

  def create
    @resist = Resist.new(resist_params)

    respond_to do |format|
      if @resist.save
---
INSERT INTO "resists" ("reference", "mic", "drug_id", "isolated_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["reference", "4563"], ["mic", 1234], ["drug_id", 2], ["isolated_id", 2], ["created_at", "2015-03-16 22:08:00.409825"], ["updated_at", "2015-03-16 22:08:00.409825"]]

  def update
    respond_to do |format|
      if @resist.update(resist_params)
---
UPDATE "resists" SET "drug_id" = ?, "updated_at" = ? WHERE "resists"."id" = ?  [["drug_id", 3], ["updated_at", "2015-03-16 22:08:23.187316"], ["id", 1]]

  def destroy
    @resist.destroy
---
DELETE FROM "resists" WHERE "resists"."id" = ?  [["id", 1]]

    def set_resist
      @resist = Resist.find(params[:id])
---
SELECT  "resists".* FROM "resists" WHERE "resists"."id" = ? LIMIT 1  [["id", 1]]