app/controllers/stats_controller.rb

  def index
     @stats = Stat.all.paginate(:per_page => 3, :page => params[:page])
---
SELECT  "stats".* FROM "stats" LIMIT 3 OFFSET 0

  def new
    @stat = Stat.new
    @genes = Gene.all
    @mutations = Mutation.all
---
SELECT "genes".* FROM "genes"
SELECT "mutations".* FROM "mutations"

  def edit
    @genes = Gene.all
    @mutations = Mutation.all
---
SELECT "genes".* FROM "genes"
SELECT "mutations".* FROM "mutations"

  def create
    @stat = Stat.new(stat_params)

    respond_to do |format|
      if @stat.save
---
INSERT INTO "stats" ("n_studies", "info", "gene_id", "mutation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["n_studies", 24], ["info", "jaksºdçafujdl"], ["gene_id", 2], ["mutation_id", 1], ["created_at", "2015-03-16 22:46:20.533324"], ["updated_at", "2015-03-16 22:46:20.533324"]]

    def set_stat
      @stat = Stat.find(params[:id])
---
SELECT  "stats".* FROM "stats" WHERE "stats"."id" = ? LIMIT 1  [["id", 1]]