app/controllers/welcome_controller.rb

  def index

  	  @search = Organism.all.paginate(:per_page => 3, :page => params[:page])
  	  #organism
  	  if params[:searchtable] == "Organisms"
      		@search = Organism.search(params[:search]).paginate(:per_page => 3, :page => params[:page])
      #origin
      elsif params[:searchtable] == "Origins"
      		@search = Origin.search(params[:search]).paginate(:per_page => 3, :page => params[:page])
      #drug
      elsif params[:searchtable] == "Drugs"
      		@search = Drug.search(params[:search]).paginate(:per_page => 3, :page => params[:page])
      #isolated
      elsif params[:searchtable] == "Isolateds"
      		@search = Isolated.search(params[:search]).paginate(:per_page => 3, :page => params[:page])
---
SELECT COUNT(*) FROM `organisms`
SELECT `organisms`.* FROM `organisms` WHERE (name like '%%' OR tax_org like '%%')
SELECT `isolateds`.* FROM `isolateds` WHERE (name like '%%' OR disease like '%%')