app/views/genes/show.html.erb

            <tbody>
              <% if @gene.mutations.any? == true %>
---
SELECT "mutations".* FROM "mutations" INNER JOIN "stats" ON "mutations"."id" = "stats"."mutation_id" WHERE "stats"."gene_id" = ?  [["gene_id", 2]]